In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/home/jishnu/Desktop/ML-dataset/ml_perfect_practice_dataset_700.csv")

In [3]:
df.head()

,age,experience_years,education_level,department,hours_per_week,projects_completed,training_hours,performance_score,monthly_income,city,annual_bonus,promotion_status
0,25,6,Diploma,IT,55,20,49,8.41,24129,Mumbai,23690,0
1,46,22,Master,Finance,47,11,32,3.15,42412,Mumbai,21176,0
2,24,6,Bachelor,Finance,37,13,85,5.80,31708,Bangalore,20128,0
3,40,22,Diploma,HR,56,8,119,2.49,48252,Chennai,12787,0
4,44,26,Master,Finance,39,10,17,7.52,39900,Bangalore,8336,0

In [4]:
df = pd.get_dummies(df,dtype = int, drop_first = True)

In [5]:
df.head()

,age,experience_years,hours_per_week,projects_completed,training_hours,performance_score,monthly_income,annual_bonus,promotion_status,education_level_Diploma,education_level_High School,education_level_Master,department_HR,department_IT,department_Operations,department_Sales,city_Chennai,city_Delhi,city_Kochi,city_Mumbai
0,25,6,55,20,49,8.41,24129,23690,0,1,0,0,0,1,0,0,0,0,0,1
1,46,22,47,11,32,3.15,42412,21176,0,0,0,1,0,0,0,0,0,0,0,1
2,24,6,37,13,85,5.80,31708,20128,0,0,0,0,0,0,0,0,0,0,0,0
3,40,22,56,8,119,2.49,48252,12787,0,1,0,0,1,0,0,0,1,0,0,0
4,44,26,39,10,17,7.52,39900,8336,0,0,0,1,0,0,0,0,0,0,0,0

In [6]:
from sklearn.preprocessing import MinMaxScaler

mm = MinMaxScaler()

col = ["age","experience_years","hours_per_week","projects_completed","training_hours","performance_score","monthly_income","annual_bonus"]

df[col] = mm.fit_transform(df[col])

In [8]:
df.describe()

,age,experience_years,hours_per_week,projects_completed,training_hours,performance_score,monthly_income,annual_bonus,promotion_status,education_level_Diploma,education_level_High School,education_level_Master,department_HR,department_IT,department_Operations,department_Sales,city_Chennai,city_Delhi,city_Kochi,city_Mumbai
count,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000,700.000000
mean,0.490376,0.454216,0.501626,0.499938,0.472649,0.544362,0.442314,0.478652,0.450000,0.257143,0.208571,0.202857,0.214286,0.212857,0.167143,0.195714,0.195714,0.201429,0.200000,0.212857
std,0.297440,0.279956,0.302091,0.296644,0.290334,0.163253,0.184222,0.149168,0.497849,0.437371,0.406578,0.402415,0.410619,0.409620,0.373370,0.397033,0.397033,0.401354,0.400286,0.409620
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.236842,0.213415,0.241379,0.260870,0.221106,0.435008,0.296405,0.374063,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,0.500000,0.463415,0.517241,0.478261,0.447236,0.541201,0.434417,0.474825,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,0.736842,0.682927,0.758621,0.739130,0.723618,0.658161,0.600860,0.575064,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [9]:
from sklearn.model_selection import train_test_split

x = df.drop("promotion_status",axis = 1)

y = df["promotion_status"]


x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.25, random_state = 42)

In [10]:
from sklearn.linear_model import LogisticRegression

lgr = LogisticRegression()

model = lgr.fit(x_train,y_train)

In [11]:
y_predict = model.predict(x_test)

In [12]:
y_predict

array([0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1])

In [14]:
from sklearn.metrics import confusion_matrix,accuracy_score

confusion_matrix(y_test,y_predict)

array([[84,  6],
       [11, 74]])

In [16]:
accuracy_score(y_test,y_predict)

0.9028571428571428